buildings = [
            {"Id": 1, "名称": "体育馆",
             "Area": 1,
             "bx": 60,  # 占地矩形左上角x坐标
             "by": 800,  # 占地矩形左上角y坐标
             "ex": 180,  # 占地矩形右下角x坐标
             "ey": 1000,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.3,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 2,
             "名称": "Teaching Building 3",
             "Area": 1,
             "bx": 49,  # 占地矩形左上角x坐标
             "by": 220,  # 占地矩形左上角y坐标
             "ex": 171,  # 占地矩形右下角x坐标
             "ey": 280,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.6,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 3,
             "名称": "Research Building 5",
             "Area": 1,
             "bx": 210,  # 占地矩形左上角x坐标
             "by": 40,  # 占地矩形左上角y坐标
             "ex": 290,  # 占地矩形右下角x坐标
             "ey": 80,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.4,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 4,
             "名称": "Research Building 6",
             "Area": 1,
             "bx": 210,  # 占地矩形左上角x坐标
             "by": 100,  # 占地矩形左上角y坐标
             "ex": 290,  # 占地矩形右下角x坐标
             "ey": 140,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.4,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 5,
             "名称": "Eating Chuan restaurant",
             "Area": 1,
             "bx": 120,  # 占地矩形左上角x坐标
             "by": 72,  # 占地矩形左上角y坐标
             "ex": 160,  # 占地矩形右下角x坐标
             "ey": 88,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.6,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 6,
             "名称": "Science Hall",
             "Area": 1,
             "bx": 322,  # 占地矩形左上角x坐标
             "by": 320,  # 占地矩形左上角y坐标
             "ex": 316,  # 占地矩形右下角x坐标
             "ey": 380,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.2,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 7,
             "名称": "Library",
             "Area": 1,
             "bx": 233,  # 占地矩形左上角x坐标
             "by": 470,  # 占地矩形左上角y坐标
             "ex": 293,  # 占地矩形右下角x坐标
             "ey": 550,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.9,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 8,
             "名称": "Career Center",
             "Area": 1,
             "bx": 180,  # 占地矩形左上角x坐标
             "by": 660,  # 占地矩形左上角y坐标
             "ex": 209,  # 占地矩形右下角x坐标
             "ey": 713,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.2,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 9,
             "名称": "Research Center",
             "Area": 1,
             "bx": 280,  # 占地矩形左上角x坐标
             "by": 660,  # 占地矩形左上角y坐标
             "ex": 309,  # 占地矩形右下角x坐标
             "ey": 740,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.3,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 10,
             "名称": "Playgroud",
             "Area": 1,
             "bx": 400,  # 占地矩形左上角x坐标
             "by": 200,  # 占地矩形左上角y坐标
             "ex": 490,  # 占地矩形右下角x坐标
             "ey": 350,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 11,
             "名称": "Teaching Building 4",
             "Area": 1,
             "bx": 49,  # 占地矩形左上角x坐标
             "by": 448,  # 占地矩形左上角y坐标
             "ex": 171,  # 占地矩形右下角x坐标
             "ey": 480,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.6,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 12,
             "名称": "Playgroud",
             "Area": 1,
             "bx": 400,  # 占地矩形左上角x坐标
             "by": 200,  # 占地矩形左上角y坐标
             "ex": 490,  # 占地矩形右下角x坐标
             "ey": 350,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 13,
             "名称": "fountain",
             "Area": 1,
             "bx": 189,  # 占地矩形左上角x坐标
             "by": 511,  # 占地矩形左上角y坐标
             "ex": 209,  # 占地矩形右下角x坐标
             "ey": 531,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.1,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 14,
             "名称": "Dormitory 2",
             "Area": 1,
             "bx": 35,  # 占地矩形左上角x坐标
             "by": 460,  # 占地矩形左上角y坐标
             "ex": 85,  # 占地矩形右下角x坐标
             "ey": 480,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.1,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 15,
             "名称": "Dormitory 2",
             "Area": 2,
             "bx": 392,  # 占地矩形左上角x坐标
             "by": 419,  # 占地矩形左上角y坐标
             "ex": 370,  # 占地矩形右下角x坐标
             "ey": 480,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 16,
             "名称": "Dormitory 1",
             "Area": 2,
             "bx": 392,  # 占地矩形左上角x坐标
             "by": 500,  # 占地矩形左上角y坐标
             "ex": 370,  # 占地矩形右下角x坐标
             "ey": 560,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 17,
             "名称": "Activity Center",
             "Area": 2,
             "bx": 525,  # 占地矩形左上角x坐标
             "by": 425,  # 占地矩形左上角y坐标
             "ex": 625,  # 占地矩形右下角x坐标
             "ey": 480,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 18,
             "名称": "Teaching Building",
             "Area": 2,
             "bx": 661,  # 占地矩形左上角x坐标
             "by": 270,  # 占地矩形左上角y坐标
             "ex": 780,  # 占地矩形右下角x坐标
             "ey": 364,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.8,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 19,
             "名称": "S2 Teaching Building",
             "Area": 2,
             "bx": 830,  # 占地矩形左上角x坐标
             "by": 10,  # 占地矩形左上角y坐标
             "ex": 920,  # 占地矩形右下角x坐标
             "ey": 190,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.7,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 20,
             "名称": "Lib",
             "Area": 2,
             "bx": 640,  # 占地矩形左上角x坐标
             "by": 425,  # 占地矩形左上角y坐标
             "ex": 740,  # 占地矩形右下角x坐标
             "ey": 480,  # 占地矩形右下角y坐标
             "func": 1,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 21,
             "名称": "Gate2",
             "Area": 2,
             "bx": 0,  # 占地矩形左上角x坐标
             "by": 380,  # 占地矩形左上角y坐标
             "ex": 0,  # 占地矩形右下角x坐标
             "ey": 380,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 22,
             "名称": "Police",
             "Area": 2,
             "bx": 100,  # 占地矩形左上角x坐标
             "by": 200,  # 占地矩形左上角y坐标
             "ex": 120,  # 占地矩形右下角x坐标
             "ey": 220,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.2,  # 拥挤度,根据ppt越小越挤
             },
            {"Id": 23,
             "名称": "Gate1",
             "Area": 1,
             "bx": 0,  # 占地矩形左上角x坐标
             "by": 249,  # 占地矩形左上角y坐标
             "ex": 0,  # 占地矩形右下角x坐标
             "ey": 380,  # 占地矩形右下角y坐标
             "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
             "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
             },
        ]