res = {
    "step": 5,
    "perfer": 4,  # 1步行最短距离策略，2步行最短时间策略，
    #3混合交通方式的最短时间,4自选交通方式为自行车和步行，5自选交通工具为校车和步行
    # "1": {
    #     "description": "沿着雁北路向南骑行700米，至第一个十字路口",
    #     #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    #     "cdntSx": 253,  # 起始横坐标
    #     "cdntSy": 639,  # 起起始纵坐标
    #     "cdntTx": 852,  # 结束横坐标
    #     "cdntSy": 677,  # 结束纵坐标
    #     "duration": 140,  # 以秒为单位
    #     "speed": 5,  # 单位m/s，实际速度=该设施拥挤度*该交通工具理想速度
    #     "bulidId": 11,  # 当前路径所位于的建筑物Id
    #     "by": 1,  # 0表示步行，1表示骑行，2表示校车
    # },
    # "2": {
    #     "description": "向右转，进入南丰东路",
    #     #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    #     "cdntSx": 852,  # 起始横坐标
    #     "cdntSy": 639,  # 起起始纵坐标
    #     "cdntTx": 860,  # 结束横坐标
    #     "cdntSy": 655,  # 结束纵坐标
    #     "duration": 20,  # 以秒为单位
    #     "speed": 3,  # 单位m/s，实际速度=该设施拥挤度*当前交通方式理想速度
    #     "bulidId": 12,  # 当前路径所位于的建筑物Id
    #     "by": 1,  # 0表示步行，1表示骑行，2表示校车
    # },
    # "3": {
    #     "description": "沿着南丰东路向东骑行500米，至自行车停泊点并停车",
    #     #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    #     "cdntSx": 860,  # 起始横坐标
    #     "cdntSy": 655,  # 起起始纵坐标
    #     "cdntTx": 1360,  # 结束横坐标
    #     "cdntSy": 670,  # 结束纵坐标
    #     "duration": 125,  # 以秒为单位
    #     "crowd": 500,  # 正在该条道路上的人/车数量
    #     "speed": 4,  # 单位m/s，实际速度=该设施拥挤度*当前交通方式理想速度
    #     "bulidId": 13,  # 当前路径所位于的建筑物Id
    #     "by": 1,  # 0表示步行，1表示骑行，2表示校车
    # },
    # "4": {
    #     "description": "向北步行100米，到达目的地：n3多功能教学楼南门",
    #     #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    #     "cdntSx": 770,  # 起始横坐标
    #     "cdntSy": 1159,  # 起起始纵坐标
    #     "cdntTx": 760,  # 结束横坐标
    #     "cdntSy": 1050,  # 结束纵坐标
    #     "duration": 50,  # 以秒为单位
    #     "speed": 2,  # 单位m/s，实际速度=该设施拥挤度*当前交通方式理想速度
    #     "bulidId": 19,  # 当前路径所位于的建筑物Id
    #     "by": 0,  # 0表示步行，1表示骑行，2表示校车
    # },
}
