from datetime import datetime,timedelta
from Utils.Database import conn
from Utils.DataFrame import cdnt,buildId
import sys,os.path as path
sys.path.append(path.dirname(__file__))
import cv2,numpy as np
#以下为地图的结构化描述，完善后，还应用numpy/cv2生成一张点整图
juilds=[
    { "Id":1,"名称":"体育馆",
      "bx":60,#占地矩形左上角x坐标
      "by":800,#占地矩形左上角y坐标
      "ex":180,#占地矩形右下角x坐标
      "ey":1000,#占地矩形右下角y坐标
      "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
      "crowd":0.3,#拥挤度,根据ppt越小越挤
    },
  { "Id":2,
    "名称":"Teaching Building 3",
    "Area":1,
    "bx":49,#占地矩形左上角x坐标
    "by":220,#占地矩形左上角y坐标
    "ex":171,#占地矩形右下角x坐标
    "ey":280,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.6,#拥挤度,根据ppt越小越挤
    },
  { "Id":3,
    "名称":"Research Building 5",
    "Area":1,
    "bx": 210,#占地矩形左上角x坐标
    "by": 40,#占地矩形左上角y坐标
    "ex": 290,#占地矩形右下角x坐标
    "ey": 80,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.4,#拥挤度,根据ppt越小越挤
    },
  { "Id": 4,
    "名称":"Research Building 6",
    "Area":1,
    "bx":210,#占地矩形左上角x坐标
    "by": 100,#占地矩形左上角y坐标
    "ex": 290,#占地矩形右下角x坐标
    "ey": 140,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.4,#拥挤度,根据ppt越小越挤
    },
  { "Id":5,
    "名称":"Eating Chuan restaurant",
    "Area":1,
    "bx": 120,#占地矩形左上角x坐标
    "by": 72,#占地矩形左上角y坐标
    "ex":160,#占地矩形右下角x坐标
    "ey":88,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.6,#拥挤度,根据ppt越小越挤
    },
  { "Id":6,
    "名称":"Science Hall",
    "Area":1,
    "bx":322,#占地矩形左上角x坐标
    "by":320,#占地矩形左上角y坐标
    "ex":316,#占地矩形右下角x坐标
    "ey":380,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.2,#拥挤度,根据ppt越小越挤
    },
  { "Id":7,
    "名称":"Library",
    "Area":1,
    "bx":233,#占地矩形左上角x坐标
    "by":470,#占地矩形左上角y坐标
    "ex":293,#占地矩形右下角x坐标
    "ey":550,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.9,#拥挤度,根据ppt越小越挤
    },
  { "Id":8,
    "名称":"Career Center",
    "Area":1,
    "bx":180,#占地矩形左上角x坐标
    "by":660,#占地矩形左上角y坐标
    "ex":209,#占地矩形右下角x坐标
    "ey":713,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.2,#拥挤度,根据ppt越小越挤
    },
  { "Id": 9,
    "名称":"Research Center",
    "Area":1,
    "bx":280,#占地矩形左上角x坐标
    "by":660,#占地矩形左上角y坐标
    "ex":309,#占地矩形右下角x坐标
    "ey":740,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.3,#拥挤度,根据ppt越小越挤
    },
  { "Id": 10,
    "名称":"Playgroud",
    "Area":1,
    "bx":400,#占地矩形左上角x坐标
    "by":200,#占地矩形左上角y坐标
    "ex":490,#占地矩形右下角x坐标
    "ey":350,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.5,#拥挤度,根据ppt越小越挤
    },
  { "Id": 11,
    "名称":"Teaching Building 4",
    "Area":1,
    "bx":49,#占地矩形左上角x坐标
    "by":448,#占地矩形左上角y坐标
    "ex":171,#占地矩形右下角x坐标
    "ey":480,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.6,#拥挤度,根据ppt越小越挤
    },
  {"Id": 12,
   "名称": "Playgroud",
   "Area": 1,
   "bx": 400,  # 占地矩形左上角x坐标
   "by": 200,  # 占地矩形左上角y坐标
   "ex": 490,  # 占地矩形右下角x坐标
   "ey": 350,  # 占地矩形右下角y坐标
   "func": 2,  # 0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
   "crowd": 0.5,  # 拥挤度,根据ppt越小越挤
   },
  # { "Id":13,"名称":"南丰东路",
  #     "bx":860,#占地矩形左上角x坐标
  #     "by":655,#占地矩形左上角y坐标
  #     "ex":1700,#占地矩形右下角x坐标
  #     "ey":670,#占地矩形右下角y坐标
  #     "func":0,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
  #     "crowd":0.6,#拥挤度,根据ppt越小越挤
  #   },
  #   { "Id":22,"名称":"n3多功能教学楼",
  #     "bx":700,#占地矩形左上角x坐标
  #     "by":920,#占地矩形左上角y坐标
  #     "ex":760,#占地矩形右下角x坐标
  #     "ey":1080,#占地矩形右下角y坐标
  #     "func":3,
  #     "crowd":0.6,#拥挤度,根据ppt越小越挤
  #   },
  #   { "Id":31,"名称":"s2科研实验楼",
  #     "bx":355,#占地矩形左上角x坐标
  #     "by":470,#占地矩形左上角y坐标
  #     "ex":1592,#占地矩形右下角x坐标
  #     "ey":1675,#占地矩形右下角y坐标
  #     "func":1,
  #     "crowd":0.7,#拥挤度,根据ppt越小越挤
  #   },
  { "Id":11,
    "名称":"fountain",
    "Area":1,
    "bx":189,#占地矩形左上角x坐标
    "by":511,#占地矩形左上角y坐标
    "ex":209,#占地矩形右下角x坐标
    "ey":531,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.1,#拥挤度,根据ppt越小越挤
    },
  { "Id":12,
    "名称":"Dormitory 2",
    "Area":1,
    "bx": 35,#占地矩形左上角x坐标
    "by": 460,#占地矩形左上角y坐标
    "ex": 85,#占地矩形右下角x坐标
    "ey": 480,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.1,#拥挤度,根据ppt越小越挤
    },
  { "Id":13,
    "名称":"Dormitory 2",
    "Area":2,
    "bx": 392,#占地矩形左上角x坐标
    "by": 419,#占地矩形左上角y坐标
    "ex": 370,#占地矩形右下角x坐标
    "ey": 480,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.5,#拥挤度,根据ppt越小越挤
    },
  { "Id":14,
    "名称":"Dormitory 1",
    "Area":2,
    "bx": 392,#占地矩形左上角x坐标
    "by": 500,#占地矩形左上角y坐标
    "ex": 370,#占地矩形右下角x坐标
    "ey": 560,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.5,#拥挤度,根据ppt越小越挤
    },
  { "Id":15,
    "名称":"Activity Center",
    "Area":2,
    "bx": 525,#占地矩形左上角x坐标
    "by": 425,#占地矩形左上角y坐标
    "ex": 625,#占地矩形右下角x坐标
    "ey": 480,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.5,#拥挤度,根据ppt越小越挤
    },
  { "Id":16,
    "名称":"Teaching Building",
    "Area":2,
    "bx": 661,#占地矩形左上角x坐标
    "by": 270,#占地矩形左上角y坐标
    "ex": 780,#占地矩形右下角x坐标
    "ey": 364,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.8,#拥挤度,根据ppt越小越挤
    },
  { "Id":17,
    "名称":"S2 Teaching Building",
    "Area":2,
    "bx": 830,#占地矩形左上角x坐标
    "by": 10,#占地矩形左上角y坐标
    "ex": 920,#占地矩形右下角x坐标
    "ey": 190,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.7,#拥挤度,根据ppt越小越挤
    },
  { "Id":18,
    "名称":"Lib",
    "Area":2,
    "bx": 640,#占地矩形左上角x坐标
    "by": 425,#占地矩形左上角y坐标
    "ex": 740,#占地矩形右下角x坐标
    "ey": 480,#占地矩形右下角y坐标
    "func":1,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.5,#拥挤度,根据ppt越小越挤
    },
  { "Id":19,
    "名称":"Gate",
    "Area":2,
    "bx": 0,#占地矩形左上角x坐标
    "by": 380,#占地矩形左上角y坐标
    "ex": 0,#占地矩形右下角x坐标
    "ey": 380,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.5,#拥挤度,根据ppt越小越挤
    },
  { "Id": 20,
    "名称":"Police",
    "Area":2,
    "bx": 100,#占地矩形左上角x坐标
    "by": 200,#占地矩形左上角y坐标
    "ex": 120,#占地矩形右下角x坐标
    "ey": 220,#占地矩形右下角y坐标
    "func":2,#0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动
    "crowd":0.2,#拥挤度,根据ppt越小越挤
    },
  ]

def get_all_build():
  """返回所有建筑信息的字典列表,以下为样例"""
  global builds
  return builds

def get_plan_c2c(s:cdnt,t:cdnt,perfer:int):
  """输入坐标->坐标，进行导航"""
  return res

def get_plan_c2b(s:cdnt,t:buildId,perfer:int):
  """输入坐标->建筑Id，进行导航"""
  return res

def get_plan_b2b(s:cdnt,t:buildId,perfer:int):
  """输入建筑Id->建筑Id，进行导航"""
  return res

def query_cdnt_with_bulidId(num:buildId):
  '''输入一个建筑物ID，输出其入矩形占地
  注意判断id是否有效，无效返回cdnt(-1,-1)'''
  
  crood=cdnt(760,1150)
  return crood

def query_crowd_with_bulidId(num:buildId):
  '''输入一个建筑物ID，查询其拥挤程度，当前在其中人数
  注意判断id是否有效，无效返回-1'''
  crood=cdnt(760,1150)
  return crood

def query_func_with_bulidId(num:buildId):
  '''输入一个建筑物ID，查询其功能,
  0为交通设施，1为上课，2为举办活动，3既可上课又可举办活动 '''
  return 0


def query_bulid_with_cdnt(crood:cdnt):
  '''输入一个坐标，输出其所在的建筑物ID,
  注意判断坐标是否有效，无效返回-1'''
  bulidId=31
  return bulidId

#构造地图时，比例尺为1格：1米
#导航返回以dict格式，样例：
res={
  "step":5,
  "perfer":4,#1步行最短距离策略，2步行最短时间策略，
  #3混合交通方式的最短时间,4自选交通方式为自行车和步行，5自选交通工具为校车和步行
  "1":{
    "description": "沿着雁北路向南骑行700米，至第一个十字路口",
    #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    "cdntSx":253, #起始横坐标
    "cdntSy":639, #起起始纵坐标
    "cdntTx":852, #结束横坐标
    "cdntSy":677,#结束纵坐标
    "duration":140,#以秒为单位
    "speed":5,#单位m/s，实际速度=该设施拥挤度*该交通工具理想速度
    "bulidId":11,#当前路径所位于的建筑物Id
    "by":1,#0表示步行，1表示骑行，2表示校车
  },
  "2":{
    "description": "向右转，进入南丰东路",
    #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    "cdntSx":852, #起始横坐标
    "cdntSy":639, #起起始纵坐标
    "cdntTx":860, #结束横坐标
    "cdntSy":655,#结束纵坐标
    "duration":20,#以秒为单位
    "speed":3,#单位m/s，实际速度=该设施拥挤度*当前交通方式理想速度
    "bulidId":12,#当前路径所位于的建筑物Id
    "by":1,#0表示步行，1表示骑行，2表示校车
  },
  "3":{
    "description": "沿着南丰东路向东骑行500米，至自行车停泊点并停车",
    #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    "cdntSx":860, #起始横坐标
    "cdntSy":655, #起起始纵坐标
    "cdntTx":1360, #结束横坐标
    "cdntSy":670,#结束纵坐标
    "duration":125,#以秒为单位
    "crowd":500,#正在该条道路上的人/车数量
    "speed":4,#单位m/s，实际速度=该设施拥挤度*当前交通方式理想速度
    "bulidId":13,#当前路径所位于的建筑物Id
    "by":1,#0表示步行，1表示骑行，2表示校车
  },
  "4":{
    "description": "向北步行100米，到达目的地：n3多功能教学楼南门",
    #以左上角为左边系原点(0，0),x轴正方向向右,y轴正方向向下
    "cdntSx":770, #起始横坐标
    "cdntSy":1159, #起起始纵坐标
    "cdntTx":760, #结束横坐标
    "cdntSy":1050,#结束纵坐标
    "duration":50,#以秒为单位
    "speed":2,#单位m/s，实际速度=该设施拥挤度*当前交通方式理想速度
    "bulidId":19,#当前路径所位于的建筑物Id
    "by":0,#0表示步行，1表示骑行，2表示校车
  },
}
